export const edit = [
  {
    target: '[data-tour="birthmenu-1"]',
    content: "คุณสามารถเปลี่ยนสีพื้นหลังของการ์ดวันเกิดได้ตามใจชอบ",
  },
  {
    target: '[data-tour="birthmenu-2"]',
    content: "เลือกเพื่อเพิ่มข้อความยาวได้ที่นี่",
  },
  {
    target: '[data-tour="birthmenu-3"]',
    content: "อัปโหลดรูปภาพจากอุปกรณ์นี้",
  },
  {
    target: '[data-tour="birthmenu-4"]',
    content: "คุณสามารถสลับด้านของการ์ดเป็นแนวนอนหรือแนวตั้งได้ตามต้องการ (บนพีซีหรือแท็ปเล็ตจะใช้ค่าเริ่มต้นเป็นแวนอน มือถือจะเป็นแนวตั้ง รูปภาพและข้อความยาวที่ถูกเพิ่มก่อนหน้าทั้งหมดจะถูกลบทั้งหมดหากสลับด้าน)",
  },
];
export const move = [
  {
    target: '[data-tour="move"]',
    content:
      "คลิกที่ไอคอนนี้จนขึ้นไอคอน 'แบมือ' และลากเพื่อย้ายข้อความยาวหรือรูปภาพได้",
  },
  {
    target: '[data-tour="text"]',
    content:
      "ดับเบิ้ลคลิกที่ข้อความยาวเพื่อแก้ไขข้อความ, เปลี่ยนสีตัวอักษร หรือลบข้อความที่เลือก",
  },
];
export const resize = [
  {
    target: '[data-tour="resize"]',
    content:
      "คลิกที่ไอคอนนี้จนขึ้นไอคอน 'ขยายรูป' และลากที่มุมของกรอบรูปเพื่อปรับขนาดรูปภาพตามที่ต้องการได้",
  },
  {
    target: '[data-tour="text"]',
    content:
      "ดับเบิ้ลคลิกที่ข้อความยาวเพื่อแก้ไขข้อความ, เปลี่ยนสีตัวอักษร หรือลบข้อความที่เลือก",
  },
];
