const steps = [
      {
        target: '[data-tour="birthmain-1"]',
        content: "ร่วมทำการ์ดอวยพรเนื่องในวันพิเศษของข้าวฟ่างกันเถอะ!"
      },
      {
        target: '[data-tour="birthmain-2"]',
        content: "คุณสามารถแก้ไขข้อความไตเติ้ลตามที่คุณต้องการ และกำหนดสีของข้อความไตเติ้ลเองได้"
      },
      {
        target: '[data-tour="birthmain-3"]',
        content: "ส่วนของพื้นที่การ์ด คุณจะสามารถวางข้อความหรือใส่รูปภาพได้อิสระ"
      },
      {
        target: '[data-tour="birthmain-4"]',
        content: "ชุดเครื่องมือในการทำการ์ดอวยพรที่ทำให้การ์ดของคุณออกมาสวยขึ้น"
      },
      {
        target: '[data-tour="birthmain-5"]',
        content: "เลือก 'ส่งออก' เพื่อดูตัวอย่างการืดที่คุณจะบันทึกเป็นไฟล์รูปภาพ และนำไปแชร์ต่อบนสื่อสังคมออนไลน์ของคุณได้"
      },
  ];
  
  export default steps;
  